#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_subnet.private_subnet[0]: Refreshing state... [id=subnet-0615072824c94eddc]
aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-0483cb35de795e3cf]
aws_subnet.public_subnet[2]: Refreshing state... [id=subnet-098a864ec55348722]
aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-01dea9eef30f8e1a1]
aws_subnet.private_subnet[4]: Refreshing state... [id=subnet-0acde4e83d950636e]
aws_subnet.public_subnet[5]: Refreshing state... [id=subnet-04ff556cf91a1724c]
aws_subnet.private_subnet[5]: Refreshing state... [id=subnet-001b060214dc20bf7]
aws_subnet.public_subnet[4]: Refreshing state... [id=subnet-0a94bf1eaad1772d2]
aws_subnet.private_subnet[1]: Refreshing state... [id=subnet-0c979d533f5b3142f]
aws_subnet.public_subnet[3]: Refreshing state... [id=subnet-0019e8782bc661676]
aws_vpc.main: Refreshing state... [id=vpc-0019a2de5322a3397]
aws_ssm_parameter.foo: Refreshing state... [id=foo]
data.aws_availability_zones.all: Reading...
data.aws_availability_zones.all: Read complete after 0s [id=us-east-1]
aws_internet_gateway.igw: Refreshing state... [id=igw-0ac123e9b2f9f6dc9]
aws_route_table_association.public_subnets_association[3]: Refreshing state... [id=rtbassoc-045d8cc6d93f78ec2]
aws_route_table_association.public_subnets_association[2]: Refreshing state... [id=rtbassoc-0b071a557018bda2f]
aws_route_table_association.public_subnets_association[4]: Refreshing state... [id=rtbassoc-0a35aeb47ba51bca7]
aws_route_table_association.public_subnets_association[0]: Refreshing state... [id=rtbassoc-0c5d20e371b53d712]
aws_route_table_association.public_subnets_association[5]: Refreshing state... [id=rtbassoc-0563d30bbd358d184]
aws_route_table_association.public_subnets_association[1]: Refreshing state... [id=rtbassoc-0f14dd6085433de0a]
aws_route.public_subnets_igw[4]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[1]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[0]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[3]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[5]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[2]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route_table_association.public_subnets_association[0] must be replaced
-/+ resource "aws_route_table_association" "public_subnets_association" {
      ~ id             = "rtbassoc-0c5d20e371b53d712" -> (known after apply)
      ~ subnet_id      = "subnet-0483cb35de795e3cf" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.public_subnets_association[1] must be replaced
-/+ resource "aws_route_table_association" "public_subnets_association" {
      ~ id             = "rtbassoc-0f14dd6085433de0a" -> (known after apply)
      ~ subnet_id      = "subnet-01dea9eef30f8e1a1" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.public_subnets_association[2] must be replaced
-/+ resource "aws_route_table_association" "public_subnets_association" {
      ~ id             = "rtbassoc-0b071a557018bda2f" -> (known after apply)
      ~ subnet_id      = "subnet-098a864ec55348722" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.public_subnets_association[3] must be replaced
-/+ resource "aws_route_table_association" "public_subnets_association" {
      ~ id             = "rtbassoc-045d8cc6d93f78ec2" -> (known after apply)
      ~ subnet_id      = "subnet-0019e8782bc661676" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.public_subnets_association[4] must be replaced
-/+ resource "aws_route_table_association" "public_subnets_association" {
      ~ id             = "rtbassoc-0a35aeb47ba51bca7" -> (known after apply)
      ~ subnet_id      = "subnet-0a94bf1eaad1772d2" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.public_subnets_association[5] must be replaced
-/+ resource "aws_route_table_association" "public_subnets_association" {
      ~ id             = "rtbassoc-0563d30bbd358d184" -> (known after apply)
      ~ subnet_id      = "subnet-04ff556cf91a1724c" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_subnet.private-subnet[0] will be created
  + resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-1"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-1"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.private-subnet[1] will be created
  + resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-2"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-2"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.private-subnet[2] will be created
  + resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-3"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-3"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.private-subnet[3] will be created
  + resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.104.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-4"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-4"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.private-subnet[4] will be created
  + resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1e"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.105.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-5"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-5"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.private-subnet[5] will be created
  + resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1f"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.106.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-6"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-6"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.private_subnet[0] will be destroyed
  # (because aws_subnet.private_subnet is not in configuration)
  - resource "aws_subnet" "private_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-0615072824c94eddc" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.0.101.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0615072824c94eddc" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-1"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-1"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.private_subnet[1] will be destroyed
  # (because aws_subnet.private_subnet is not in configuration)
  - resource "aws_subnet" "private_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-0c979d533f5b3142f" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.0.102.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0c979d533f5b3142f" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-2"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-2"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.private_subnet[4] will be destroyed
  # (because aws_subnet.private_subnet is not in configuration)
  - resource "aws_subnet" "private_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-0acde4e83d950636e" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1e" -> null
      - availability_zone_id                           = "use1-az3" -> null
      - cidr_block                                     = "10.0.105.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0acde4e83d950636e" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-5"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-5"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.private_subnet[5] will be destroyed
  # (because aws_subnet.private_subnet is not in configuration)
  - resource "aws_subnet" "private_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-001b060214dc20bf7" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1f" -> null
      - availability_zone_id                           = "use1-az5" -> null
      - cidr_block                                     = "10.0.106.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-001b060214dc20bf7" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-6"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-6"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.public-subnet[0] will be created
  + resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-1"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-1"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.public-subnet[1] will be created
  + resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-2"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-2"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.public-subnet[2] will be created
  + resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-3"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-3"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.public-subnet[3] will be created
  + resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-4"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-4"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.public-subnet[4] will be created
  + resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1e"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-5"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-5"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.public-subnet[5] will be created
  + resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1f"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-6"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-6"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.public_subnet[0] will be destroyed
  # (because aws_subnet.public_subnet is not in configuration)
  - resource "aws_subnet" "public_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-0483cb35de795e3cf" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0483cb35de795e3cf" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-1"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-1"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.public_subnet[1] will be destroyed
  # (because aws_subnet.public_subnet is not in configuration)
  - resource "aws_subnet" "public_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-01dea9eef30f8e1a1" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.0.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-01dea9eef30f8e1a1" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-2"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-2"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.public_subnet[2] will be destroyed
  # (because aws_subnet.public_subnet is not in configuration)
  - resource "aws_subnet" "public_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-098a864ec55348722" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1c" -> null
      - availability_zone_id                           = "use1-az4" -> null
      - cidr_block                                     = "10.0.3.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-098a864ec55348722" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-3"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-3"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.public_subnet[3] will be destroyed
  # (because aws_subnet.public_subnet is not in configuration)
  - resource "aws_subnet" "public_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-0019e8782bc661676" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1d" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.0.4.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0019e8782bc661676" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-4"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-4"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.public_subnet[4] will be destroyed
  # (because aws_subnet.public_subnet is not in configuration)
  - resource "aws_subnet" "public_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-0a94bf1eaad1772d2" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1e" -> null
      - availability_zone_id                           = "use1-az3" -> null
      - cidr_block                                     = "10.0.5.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0a94bf1eaad1772d2" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-5"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-5"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.public_subnet[5] will be destroyed
  # (because aws_subnet.public_subnet is not in configuration)
  - resource "aws_subnet" "public_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-04ff556cf91a1724c" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1f" -> null
      - availability_zone_id                           = "use1-az5" -> null
      - cidr_block                                     = "10.0.6.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-04ff556cf91a1724c" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-6"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-6"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

Plan: 18 to add, 0 to change, 16 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @shubhamcommits, Action: `pull_request`*